БухЭксп/DataProcessors/CW_ПодключаемаяОбработкаОтправляемыхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПодключаемаяОбработкаОтправляемыхПисем</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодключаемыйОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаАдресДляОтправкиПисьма</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_УчетныеЗаписиЭлектроннойПочты</Name>
			<Comment>Учетные записи электронной почты</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераPOP3</Name>
					<Comment>Адрес сервера POP3</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераSMTP</Name>
					<Comment>Адрес сервера SMTP</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжидания</Name>
					<Comment>Таймаут по запросу почты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль для доступа к POP3 серверу.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Comment>Пароль для доступа к SMTP серверу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь POP3 сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательSMTP</Name>
					<Comment>Пользователь SMTP сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Comment>Порт POP3</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Comment>Порт SMTP</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияSMTP</Name>
					<Comment>Признак аутентификации по SMTP</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3SMTP</Name>
					<Comment>Использовать параметры получения почты (POP3)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалениеССервера</Name>
					<Comment>Удалять письма с сервера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POPSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервераIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSSLIMAP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьОтправленныеПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПодключаемаяОбработкаОтправляемыхПисем/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте();
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиОбработкаОтправляемыхПисем();
	
	СтруктураОписания.Наименование 				= "Обработка отправляемых писем (пример)";
	СтруктураОписания.Описание 					= "Пример работы с отправляемымми письмами";
	СтруктураОписания.Версия 					= "3.2.0";
	СтруктураОписания.МинимальнаяВерсияМодуля	= "8.3.10.10";
	СтруктураОписания.Настройка 				= Истина;

	//Методы обработчика
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "ОбработатьПараметрыФормыОтправкиПисьма");
	
	//Формы обработчика
	CW_ПодключаемыеКомандыСервер.УстановитьИмяФормыНастроекОбъекта(СтруктураОписания, 	"ФормаНастройки");
	
	Возврат СтруктураОписания;

	
КонецФункции

// Пример функции доработки параметров
Функция ОбработатьПараметрыФормыОтправкиПисьма(струПараметрыФормыОтправкиПисьма) Экспорт 
	
	СтруктураОтвета = Новый Структура("Код, ОписаниеОшибки", 0, "");
	
	//струПараметрыФормыОтправкиПисьма = Новый Структура("СтруктураПисьма, Событие");
	//.Событие         = Новый Структура("Контрагент, ОбъектСобытия", Док.Контрагент, Док);
	//.СтруктураПисьма = _ЭП.СтруктураПисьма();
	//СП = Новый Структура;
	//СП.Вставить("Кодировка","UTF-8");
	//СП.Вставить("Важность",ВажностьИнтернетПочтовогоСообщения.Обычная);
	//СП.Вставить("Категории", "");
	//// --- 
	//СП.Вставить("Отправитель",Справочники.УчетныеЗаписиЭлектроннойПочты.ПустаяСсылка()); // учетная запись ЭП (!!!)
	//// адреса - массив из структур адреса (Адрес-ОтображаемоеИмя)
	//СП.Вставить("ОбратныеАдреса",Новый Массив); // необязательный
	//СП.Вставить("Получатели",Новый Массив);
	//СП.Вставить("Получатели_Копии",Новый Массив);
	//СП.Вставить("Получатели_СкрытыеКопии",Новый Массив);
	//// --- 
	//СП.Вставить("Тема","");
	//СП.Вставить("Тексты",Новый Массив); // значение - структура Текст-ТипТекста-Кодировка
	//СП.Вставить("Вложения",Новый Массив); // значение - структура ИмяФайла-ТипАдреса-Адрес
	
	стру = _ПО.ПолучитьНастройкиОбработки(ПодключаемыйОбъект);
	Если ТипЗнч(стру) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, стру);
	КонецЕсли;
	
	док = струПараметрыФормыОтправкиПисьма.Событие.ОбъектСобытия;
	Если ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")
		и ЗначениеЗаполнено(док)
		и док.ФормируетсяСчет
	Тогда 
		// только для счетов
		
		Если ЗначениеЗаполнено(ХарактеристикаАдресДляОтправкиПисьма) Тогда 
			з = Новый Запрос(
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	влож.АдресДляОтправкиПисьма
				|ИЗ
				|	(ВЫБРАТЬ
				|		ВЫРАЗИТЬ(CW_ХарактеристикиГрузоперевозок.Значение КАК СТРОКА(256)) КАК АдресДляОтправкиПисьма
				|	ИЗ
				|		Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК CW_ХарактеристикиГрузоперевозок
				|			ПО CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка = CW_ХарактеристикиГрузоперевозок.Грузоперевозка
				|				И (CW_ХарактеристикиГрузоперевозок.Параметр = &ХарактеристикаАдресДляОтправкиПисьма)
				|	ГДЕ
				|		CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДоходыСсылка
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		CW_УчетныеЗаписиЭлектроннойПочты.ПочтовыйАдрес
				|	ИЗ
				|		Справочник.CW_УчетныеЗаписиЭлектроннойПочты КАК CW_УчетныеЗаписиЭлектроннойПочты
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
				|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
				|				ПО CW_НастройкиПользователей.Пользователь.ФизическоеЛицо = CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка.ОперативныйМенеджер
				|					И (CW_ДоходыПоГрузоперевозкеУслуги.Ссылка = &ДоходыСсылка)
				|			ПО CW_УчетныеЗаписиЭлектроннойПочты.Ссылка = CW_НастройкиПользователей.УчетнаяЗаписьЭлектроннойПочты) КАК влож"
			);
			з.УстановитьПараметр("ДоходыСсылка", док);
			з.УстановитьПараметр("ХарактеристикаАдресДляОтправкиПисьма", ХарактеристикаАдресДляОтправкиПисьма);
			рз = з.Выполнить();
			выб = рз.Выбрать();
			Пока выб.Следующий() Цикл
				// если есть адрес и его ещё нет в письме, то добавим
				Если ЗначениеЗаполнено(выб.АдресДляОтправкиПисьма) 
					И Неопределено=струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели.Найти(выб.АдресДляОтправкиПисьма)
					И Неопределено=струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_Копии.Найти(выб.АдресДляОтправкиПисьма)
				Тогда 
					// в копию
					_ЭП.ДобавитьПолучателейИзСтроки(струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_Копии, выб.АдресДляОтправкиПисьма);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	//// пример упрощённый, не для подражания
	//
	//// можно делать некие общие действия для всех отправляемых писем
	//_ЭП.ДобавитьПолучателейИзСтроки(струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Получатели_СкрытыеКопии, "s.anton@coralway.ru");
	//
	//Если "Сатурн"=СокрЛП(струПараметрыФормыОтправкиПисьма.Событие.Контрагент) Тогда 
	//	// для некоторых условий можно доработать письмо немного иначе, чем обычно
	//	струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Тексты[0].Текст = 
	//		струПараметрыФормыОтправкиПисьма.СтруктураПисьма.Тексты[0].Текст
	//		+ Символы.ПС 
	//		+ Символы.ПС 
	//		+ "PS Просьба не забывать возвращать оригиналы документов! Иначе получится как в тот раз!"
	//	;
	//КонецЕсли;
	
	// можно по некоторому условию (например, выполнив отправку прямо отсюда) отказаться от вызова стандартной интерактивной формы отправки
	//СтруктураОтвета.Вставить("ОткрыватьСтандартнуюФормуОтправкиПочты", Ложь);
	
	Возврат СтруктураОтвета;

КонецФункции
#КонецЕсли
